let 내구도 = [1, 2, 1, 4];
let 독 = [{
    "이름" : "루비독",
    "나이" : "95년생",
    "점프력" : "3",
    "몸무게" : "4",
    },{
    "이름" : "피치독",
    "나이" : "95년생",
    "점프력" : "3",
    "몸무게" : "3",
    },{
    "이름" : "씨-독",
    "나이" : "72년생",
    "점프력" : "2",
    "몸무게" : "1",
    },{
    "이름" : "코볼독",
    "나이" : "59년생",
    "점프력" : "1",
    "몸무게" : "1",
    },
];

function 징검다리(내구도, 독){
    let answer = [];
    for(let 개별독 of 독){
        answer.push(개별독['이름']);
    }

    return answer;
}

console.log(징검다리(내구도, 독))
